Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.ModelGUID Property
Note: This API is now obsolete.
 The ModelGUID of the reference model in the Project Center.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Does currently nothing. Will be removed in near future.")]
public Guid ModelGUID { get; set; }
<ObsoleteAttribute("Does currently nothing. Will be removed in near future.")>
Public Property ModelGUID As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace